import 'sutta.dart';

final List<Sutta> suttas = [
  Sutta(id: 1, name: 'မဟာသမယသုတ်', history: [
    'ဆုတောင်းပြည့်လိုလျှင်',
    'လူခြေတိတ်ချိန်၌',
    'နတ်ပင့်ပြီး',
    'ရိုရိုသေသေ ရွတ်ဖတ်ပူဇော်ပေးပါ။',
  ], method: [
    'နမော တဿ ဘဂ၀တော အရဟတော သမ္မာသမ္ဗုဒ္ဓဿ',
    '၁။ ဧ၀ံ မေ သုတံ - ဧကံ သမယံ ဘဂ၀ါ သက္ကေသု ၀ိဟရတိ ကပိလ၀တ္ထုသ္မိံ မဟာ၀နေ မဟတာ ဘိက္ခုသံဃေန သဒ္ဓိံ ပဉ္စမတ္တေဟိ ဘိက္ခုသတေဟိ သဗ္ဗေဟေ၀  အရဟန္တေဟိ ဒသဟိ စ လောကဓာတူဟိ ဒေ၀တာ ယေဘုယျေန သန္နိပတိတာ ဟောန္တိ ဘဂ၀န္တံ ဒဿနာယ ဘိက္ခုသံဃဉ္စ။ အထ ခေါ စတုန္နံ သုဒ္ဓါ၀ါသကာယိကာနံ ဒေ၀တာနံ ဧတဒဟောသိ `အယံ ခေါ ဘဂ၀ါ သက္ကေသု ၀ိဟရတိ ကပိလ၀တ္ထုသ္မိံ မဟာ၀နေ မဟတာ ဘိက္ခုသံဃေန သဒ္ဓိံ ပဉ္စမတ္တေဟိ ဘိက္ခုသတေဟိ သဗ္ဗေဟေ၀  အရဟန္တေဟိ ဒသဟိ စ လောကဓာတူဟိ ဒေ၀တာ ယေဘုယျေန သန္နိပတိတာ ဟောန္တိ ဘဂ၀န္တံ ဒဿနာယ ဘိက္ခုသံဃဉ္စ။ ယံနူန မယမ္ပိ ယေန ဘဂ၀ါ တေနုပသင်္ကမေယျာမ၊ ဥပသင်္ကမိတွာ ဘဂ၀တော သန္တိကေ ပစ္စေကံ ဂါထံ ဘာသေယျာမာ` တိ။ ',
    'အထ ခေါ တာ ဒေ၀တာ သေယျထာပိ နာမ ဗလ၀ါ ပုရိသော သမိဉ္ဇိတံ ၀ါ ဗာဟံ ပသာရေယျ, ပသာရိတံ ၀ါ ဗာဟံ သမိဉ္ဇေယျ၊ ဧ၀မေ၀ သုဒ္ဓါ၀ါသေသု ဒေ၀ေသု အန္တရဟိတာ ဘဂ၀ောာ ပုရတော ပါတုရဟေသုံ။ အထ ခေါ တာ ဒေ၀တာ ဘဂ၀န္တံ အဘိ၀ါဒေတွာ ဧကမန္တံ အဋ္ဌံသု။',
    'ဧကမန္တံ ဌိတာ ခေါ ဧကာ ဒေ၀တာ ဘဂ၀တော သန္တိကေ ဣမံ ဂါထာ အဘာသိ-',
    '`မဟာသမယော ပ၀နသ္မိံ၊ ဒေ၀ကာယာ သမာဂတာ။ အာဂတမှ ဣမံ ဓမ္မသမယံ၊ ဒက္ခိတာယေ အပရာဇိတသံဃ`န္တိ။',
    '၂။ အထ ခေါ အပရာ ဒေ၀တာ ဘဂ၀တော သန္တိကေ ဣမံ ဂါထာ အဘာသိ-',
    '`တတြ ဘိက္ခ၀ေါ သမာဒဟံသု၊ စိတ္တမတ္တနော ဥဇုကံ အကံသု။ သာရထီ၀ နေတ္တာနိ ဂဟေတွာ၊ ဣန္ဒြိယာနိ ရက္ခန္တိ ပဏ္ဍိတာ`တိ။',
    '၃။အထ ခေါ အပရာ ဒေ၀တာ ဘဂ၀တော သန္တိကေ ဣမံ ဂါထာ အဘာသိ-',
    '`ဆေတွာ ခိလံ ဆေတွာ ပလိဃံ၊ ဣန္ဒခီလံ ဦဟစ္စ မနေဇာ။ တေ စရန္တိ သုဒ္ဓါ ၀ိမလာ၊ စက္ခုမတာ သုဒန္တာ သုသုနာဂါ`တိ။',
    '၄။အထ ခေါ အပရာ ဒေ၀တာ ဘဂ၀တော သန္တိကေ ဣမံ ဂါထာ အဘာသိ-',
    '`ယေ ကေစိ ဗုဒ္ဓံ သရဏံ ဂတာသေ၊ န သေ ဂမိဿန္တိ အပါယဘူမိံ။ ပဟာယ မာနုသံ ဒေဟံ၊ ဒေ၀ကာယံ ပရိပူရေဿန္တီ`တိ။',
  ]),
  Sutta(id: 2, name: 'ပဋ္ဌာန်း ဒေသနာတော်', history: [
    'လူယုတ်မာများနှင့် ၀ေးလိုလျှင်',
    'အကြံအစည်မှန်သမျှ',
    'အောင်မြင်လိုလျှင်',
    'အဓိဋ္ဌာန်ဖြင့် ရွတ်ပါ။',
  ], method: [
    'ပဋ္ဌာန်း ဒေသနာတော်',
    'ပဋ္ဌာန်း ဒေသနာတော်',
    'ပဋ္ဌာန်း ဒေသနာတော်',
    'ပဋ္ဌာန်း ဒေသနာတော်',
  ]),
  Sutta(id: 3, name: 'မေတ္တသုတ်', history: [
    'အချစ်မခံရလျှင်',
    'မျက်နှာ အကြည်ဓာတ် ပျက်ယွင်းနေလျှင်',
    'လူမုန်းများနေလျှင်',
    'သောက ရောက်နေလျှင်',
    'အဓိဋ္ဌာန်ဖြင့် ရွတ်ပါ။'
  ], method: [
    'မေတ္တသုတ်',
    'မေတ္တသုတ်',
    'မေတ္တသုတ်',
    'မေတ္တသုတ်',
  ]),
  Sutta(id: 4, name: 'ဓဇဂ္ဂသုတ်', history: [
    'စစ်ဖြစ်ပြီး',
    'ကြောက်မက်ဖွယ်ရာများ ကြုံနေရလျှင်',
    'ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဓဇဂ္ဂသုတ်',
    'ဓဇဂ္ဂသုတ်',
    'ဓဇဂ္ဂသုတ်',
    'ဓဇဂ္ဂသုတ်',
  ]),
  Sutta(id: 5, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
  Sutta(id: 6, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
  Sutta(id: 7, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
  Sutta(id: 8, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
  Sutta(id: 9, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
  Sutta(id: 10, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
  Sutta(id: 11, name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်', history: [
    'စိတ်ဓာတ်ကျပြီး',
    'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
    'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
  ], method: [
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ]),
];
