import 'sutta.dart';

final List<Sutta> suttas = [
  Sutta(
    id: 1,
    name: 'မဟာသမယသုတ်',
    history: [
      'ဆုတောင်းပြည့်လိုလျှင်',
      'လူခြေတိတ်ချိန်၌',
      'နတ်ပင့်ပြီး',
      'ရိုရိုသေသေ ရွတ်ဖတ်ပူဇော်ပေးပါ။',
    ],
    method: 'မဟာသမယသုတ်တော်',
  ),
  Sutta(
    id: 2,
    name: 'ပဋ္ဌာန်း ဒေသနာတော်',
    history: [
      'လူယုတ်မာများနှင့် ၀ေးလိုလျှင်',
      'အကြံအစည်မှန်သမျှ',
      'အောင်မြင်လိုလျှင်',
      'အဓိဋ္ဌာန်ဖြင့် ရွတ်ပါ။',
    ],
    method: 'ပဋ္ဌာန်း ဒေသနာတော်',
  ),
  Sutta(
    id: 3,
    name: 'မေတ္တသုတ်',
    history: [
      'အချစ်မခံရလျှင်',
      'မျက်နှာ အကြည်ဓာတ် ပျက်ယွင်းနေလျှင်',
      'လူမုန်းများနေလျှင်',
      'သောက ရောက်နေလျှင်',
      'အဓိဋ္ဌာန်ဖြင့် ရွတ်ပါ။'
    ],
    method: 'မေတ္တသုတ်',
  ),
  Sutta(
    id: 4,
    name: 'ဓဇဂ္ဂသုတ်',
    history: [
      'စစ်ဖြစ်ပြီး',
      'ကြောက်မက်ဖွယ်ရာများ ကြုံနေရလျှင်',
      'ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဓဇဂ္ဂသုတ်',
  ),
  Sutta(
    id: 5,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
  Sutta(
    id: 6,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
  Sutta(
    id: 7,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
  Sutta(
    id: 8,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
  Sutta(
    id: 9,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
  Sutta(
    id: 10,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
  Sutta(
    id: 11,
    name: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
    history: [
      'စိတ်ဓာတ်ကျပြီး',
      'အနာဂတ် မရှိတော့သလို ခံစားနေရလျှင်',
      'စွမ်းနိုင်သမျှ ရွတ်ဖတ်ပါ။',
    ],
    method: 'ဗုဒ္ဓါနုဿတိ ဂုဏ်တော်',
  ),
];
